Tekla.Structures.DirectManipulation.Model.CreationCommands.ReinforcementTypeProvider
The Tekla.Structures.DirectManipulation.Model.CreationCommands.ReinforcementTypeProvider class provides the creation commands for creating a Tekla.Structures.DirectManipulation.Model.CreationCommands.Reinforcement typed object.

Tekla.Structures.DirectManipulation.Model.CreationCommands.ReinforcementTypeProvider.#ctor
Initializes a new instance of the Tekla.Structures.DirectManipulation.Model.CreationCommands.ReinforcementTypeProvider class.

Tekla.Structures.DirectManipulation.Model.CreationCommands.ReinforcementTypeProvider.CurvedRebar
Gets the creation commands for creating a curved rebar.

Tekla.Structures.DirectManipulation.Model.CreationCommands.ReinforcementTypeProvider.RebarGroup
Gets the creation commands for creating a rebar group.

Tekla.Structures.DirectManipulation.Model.CreationCommands.ReinforcementTypeProvider.RebarMesh
Gets the creation commands for creating a rebar mesh.

Tekla.Structures.DirectManipulation.Model.CreationCommands.ReinforcementTypeProvider.RebarSplice
Gets the creation commands for creating a rebar splice.

Tekla.Structures.DirectManipulation.Model.CreationCommands.ReinforcementTypeProvider.SingleRebar
Gets the creation commands for creating a single rebar.

Tekla.Structures.DirectManipulation.Model.CreationCommands.ReinforcementTypeProvider.RebarSet
Gets the creation commands for creating a rebar set.